app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (published = true) ORDER BY published_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `articles` WHERE (published = true)
---
  def index
    if params[:category_id]
      @articles_pages = Article.paginate(
        :page => params[:page],
        :order => 'published_at DESC'
        )

SELECT * FROM `articles` WHERE (`articles`.`id` = 0)
SELECT * FROM `articles` WHERE (`articles`.`published` = '5')
---
  def show
  	if is_logged_in? && @logged_in_user.has_role?('Editor')
  		@article = Article.find(params[:id])
  	else
  		@article = Article.find_all_by_published(params[:id], true)

INSERT INTO `articles` (`created_at`, `title`, `body`, `published`, `updated_at`, `user_id`, `category_id`, `published_at`, `synopsis`) VALUES('2009-09-15 07:12:02', 'test ', 'adqwgftqwfasdasdasfqwfqdsdadas\r\ndasdasdasda\r\nsdasffgasfaafsdqqwdasd', 1, '2009-09-15 07:12:02', NULL, 1, '2009-09-15 07:12:02', 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa')
---
  def create
  	@article = Article.create(params[:article])

SELECT * FROM `articles` WHERE (`articles`.`id` = 5)
UPDATE `articles` SET `updated_at` = '2009-09-15 08:39:37', `synopsis` = 'ちょっと待ってください。\r\n', `published_at` = '2009-09-15 08:39:37', `body` = 'がんばる がんばる がんばる.' WHERE `id` = 5
---
  def update
  	@article = Article.find(params[:id])
  	@article.update_attributes(params[:article])

SELECT * FROM `articles` ORDER BY published_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `articles`
---
  def admin
  	@articles_pages = Article.paginate(:page => params[:page],
  									   :order => 'published_at DESC' )