app/controllers/categories_controller.rb

  def create
  	@category = Category.create(params[:category])
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('wow', '2009-09-18 06:15:09', '2009-09-18 06:15:09')

  def update
  	@category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 3)

  def destroy
  	@category = Category.find(params[:id])
  	@category.find(params[:id]).destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
DELETE FROM `categories` WHERE `id` = 2