app/controllers/roles_controller.rb

	def index
		@user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

	def update
    @user = User.find(params[:user_id])
    @role = Role.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)

	def destroy
		@user = User.find(params[:user_id])
		@role = Role.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)