app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def index
  	@users = User.find(:all)

SELECT * FROM `users` WHERE (`users`.`username` = 'woody') LIMIT 1
---
  def show_by_username
  	@user = User.find_by_username(params[:username])

INSERT INTO `users` (`created_at`, `profile`, `updated_at`, `username`, `hashed_password`, `enabled`, `last_login_at`, `email`) VALUES('2009-09-14 06:33:34', 'Hi', '2009-09-14 06:33:34', 'woody', '1e40d5234f9de5f6225cca5c87841461656ae5727608f07b1301b9c8ec1b8e20', 1, NULL, 'unix1983@gmail.com')
---
  def create
  	@user = User.new(params[:user])
  	if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2009-09-14 08:06:01', `hashed_password` = 'e1a16cf7660371e88903899c0878c29c6069f9d73aad69a11c9206c88a71e412' WHERE `id` = 2
---
  def update
  	@user = User.find(logged_in_user)
  	if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `enabled` = 0, `updated_at` = '2009-09-14 07:40:32' WHERE `id` = 1
---
  def destroy
  	@user = User.find(params[:id])
  	if @user.update_attribute(:enabled, false)

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `enabled` = 1, `updated_at` = '2009-09-14 07:41:36' WHERE `id` = 1
---
  def enable
  	@user = User.find(params[:id])
  	if @user.update_attribute(:enabled, true)